Revit 2015 API
View3D.SetSectionBox Method
 Sets the section box.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
Syntax
C#
public void SetSectionBox(
	BoundingBoxXYZ boundingBoxXYZ
)
Visual Basic
Public Sub SetSectionBox ( _
	boundingBoxXYZ As BoundingBoxXYZ _
)
Visual C++
public:
void SetSectionBox(
	BoundingBoxXYZ^ boundingBoxXYZ
)
Parameters
boundingBoxXYZ
Type: Autodesk.Revit.DB.BoundingBoxXYZ
 The bounding box to use for the section box.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentException |  Bounding box cannot be empty.
Autodesk.Revit.Exceptions.ArgumentNullException |  A non-optional argument was NULL
Autodesk.Revit.Exceptions.InvalidOperationException |  View cannot be a template view.
See Also
View3D Class
Autodesk.Revit.DB Namespace